### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # azurerm_private_dns_resolver_forwarding_rule.corp_mycompany_com will be created
+   resource "azurerm_private_dns_resolver_forwarding_rule" "corp_mycompany_com" {
+       dns_forwarding_ruleset_id = (known after apply)
+       domain_name               = "corp.mycompany.com."
+       enabled                   = true
+       id                        = (known after apply)
+       name                      = "corp_mycompany_com"

+       target_dns_servers {
+           ip_address = "10.0.0.3"
+           port       = 53
        }
+       target_dns_servers {
+           ip_address = "10.0.0.4"
+           port       = 53
        }
    }

  # azurerm_subnet.outbound will be updated in-place
!   resource "azurerm_subnet" "outbound" {
        id                                             = "/subscriptions/198f99fd-b969-4fad-9b99-7f0d125f8eb9/resourceGroups/rg-dns-resolver-test-966cde5fc7734c71/providers/Microsoft.Network/virtualNetworks/vnet-dns-resolver/subnets/snet-dns-resolver-outbound"
        name                                           = "snet-dns-resolver-outbound"
        # (9 unchanged attributes hidden)

+       delegation {
+           name = "Microsoft.Network.dnsResolvers"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
+               name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # module.dns-private-resolver.azurerm_private_dns_resolver_dns_forwarding_ruleset.forwarding_ruleset["outbound-default-ruleset"] will be created
+   resource "azurerm_private_dns_resolver_dns_forwarding_ruleset" "forwarding_ruleset" {
+       id                                         = (known after apply)
+       location                                   = "westeurope"
+       name                                       = "default-ruleset"
+       private_dns_resolver_outbound_endpoint_ids = (known after apply)
+       resource_group_name                        = "rg-dns-resolver-test-966cde5fc7734c71"
+       tags                                       = {
+           "Configuration" = "Terraform"
        }
    }

  # module.dns-private-resolver.azurerm_private_dns_resolver_outbound_endpoint.private_dns_resolver_outbound_endpoint["outbound"] will be created
+   resource "azurerm_private_dns_resolver_outbound_endpoint" "private_dns_resolver_outbound_endpoint" {
+       id                      = (known after apply)
+       location                = "westeurope"
+       name                    = "outbound"
+       private_dns_resolver_id = "/subscriptions/198f99fd-b969-4fad-9b99-7f0d125f8eb9/resourceGroups/rg-dns-resolver-test-966cde5fc7734c71/providers/Microsoft.Network/dnsResolvers/test-dns-private-resolver"
+       subnet_id               = "/subscriptions/198f99fd-b969-4fad-9b99-7f0d125f8eb9/resourceGroups/rg-dns-resolver-test-966cde5fc7734c71/providers/Microsoft.Network/virtualNetworks/vnet-dns-resolver/subnets/snet-dns-resolver-outbound"
+       tags                    = {
+           "Configuration" = "Terraform"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>